src/integration-test/resources/applicantIT/__files/test03_getApplicantErrandsForOrganization/mappings/api-byggr-read-errands-without-leading-16.json

{
	"name": "api-byggr-read-errands-without-leading-16",
	"request": {
		"method": "POST",
		"urlPath": "/api-byggr/endpoint",
		"headers": {
			"Content-Type": {
				"equalTo": "text/xml;charset=UTF-8"
			}
		},
        "bodyPatterns" : [{
          "equalToXml" : "<?xml version=\"1.0\" encoding=\"UTF-8\" ?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><GetRelateradeArendenByPersOrgNrAndRole xmlns=\"www.tekis.se/ServiceContract\"><persOrgNr>556677-1234</persOrgNr><statusfilter>Aktiv</statusfilter></GetRelateradeArendenByPersOrgNrAndRole></SOAP-ENV:Body></SOAP-ENV:Envelope>"
	    }]
	},
	"response": {
		"headers": {
			"Content-Type": "application/xml"
		},
		"status": 200,
		"bodyFileName": "test03_getApplicantErrandsForOrganization/responses/api-byggr-read-errands-without-leading-16-response.xml"
	}
}